papers/tac12.html
---
comments: true
layout: page
title: ! 'Kalman Filtering with Intermittent Observations: Tail Distribution and Critical Value'
---
<hr />
<p>
<b>Yilin Mo and Bruno Sinopoli</b>
</p>

<p>
<i>IEEE Transactions on Automatic Control</i>, Mar 2012, Volume 57, Issue 3, Pages 677-689
</p>

<p>
Link to the <a href="../../../public/papers/journal2009kalman.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fjournal2009kalman.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>
<div id="outline-container-orga173b6a" class="outline-2">
<h2 id="orga173b6a">Abstract</h2>
<div class="outline-text-2" id="text-orga173b6a">
<p>
In this paper, we analyze the performance of Kalman filtering for discrete-time linear Gaussian systems, where packets containing observations are dropped according to a Markov process modeling a Gilbert-Elliot channel. To address the challenges incurred by the loss of packets, we give a new definition of non-degeneracy, which is essentially stronger than the classical definition of observability, but much weaker than one-step observability, which is usually used in the study of Kalman filtering with intermittent observations. We show that the trace of the Kalman estimation error covariance under intermittent observations follows a power decay law. Moreover, we are able to compute the exact decay rate for non-degenerate systems. Finally, we derive the critical value for non-degenerate systems based on the decay rate, improving upon the state of the art.
</p>
</div>
</div>

<div id="outline-container-org9a5c538" class="outline-2">
<h2 id="org9a5c538">Corrections</h2>
<div class="outline-text-2" id="text-org9a5c538">
<p>
The Theorem 4 is flawed due to the fact that in (39), \(\text{det}(U)\) could be zero. However, the main results (Theorem 5-8) still hold. To fix the problem in (39), one can check the proof of Theorem 7 in the <a href="http://arxiv.org/abs/1005.2442">arxiv paper</a>. 
</p>
</div>
</div>
